app/views/photos/new.html.erb

SELECT "prompts".* FROM "prompts"
---
        <!--  <td><%=form.label ("Prompt Submission:")%></td> -->
        <!-- <td><%=form.collection_select(:prompt_id, Prompt.all, :id, :title)%></td> -->