app/controllers/photos_controller.rb

	def index()
		@prompt = Prompt.find_by_id(params[:prompt_id])
		@photo = Photo.find_by_id(params[:id])
---
SELECT "prompts".* FROM "prompts" WHERE "prompts"."id" IS NULL LIMIT 1
SELECT "photos".* FROM "photos" WHERE "photos"."id" IS NULL LIMIT 1

	def show()
		@prompt = Prompt.find_by_id(params[:prompt_id])
		@photo = Photo.find_by_id(params[:id])
---
SELECT "prompts".* FROM "prompts" WHERE "prompts"."id" = 1 LIMIT 1
SELECT "photos".* FROM "photos" WHERE "photos"."id" = 1 LIMIT 1

	def new()
		@prompt = Prompt.find_by_id(params[:prompt_id])
---
SELECT "prompts".* FROM "prompts" WHERE "prompts"."id" = 7 LIMIT 1

	def create()
		@prompt = Prompt.find_by_id(params[:prompt_id])
		if params[:photo][:photo]
  			uploaded_io = params[:photo][:photo]
  			File.open(Rails.root.join('app', 'assets', 'images', uploaded_io.original_filename), 'wb') do |file|
    			file.write(uploaded_io.read)
 			end
		end

		@photo = Photo.new
		@photo.date_time = DateTime.now
		if params[:photo][:photo]
			@photo.user_name = params[:photo][:user_name]
			@photo.creation_title = params[:photo][:creation_title]
			@photo.image_file = params[:photo][:photo].original_filename
			@photo.prompt_id = @prompt.id
		end
		if @photo.save
---
SELECT "prompts".* FROM "prompts" WHERE "prompts"."id" = 0 LIMIT 1
INSERT INTO "photos" ("creation_title", "date_time", "file_name", "prompt_id", "user_name") VALUES (?, ?, ?, ?, ?)  [["creation_title", "my baby"], ["date_time", Wed, 23 Jul 2014 21:11:22 UTC +00:00], ["file_name", "2012-12-29 10.37.17.jpg"], ["prompt_id", 1], ["user_name", "Marielos"]]