app/controllers/prompts_controller.rb

SELECT "prompts".* FROM "prompts" WHERE "prompts"."id" = 1 LIMIT 1
---
	def show()
		@prompt = Prompt.find_by_id(params[:id])

INSERT INTO "prompts" ("title") VALUES (?)  [["title", "do somethng pup"]]
---
	def create()
		@prompt = Prompt.new
		@prompt.title = params[:prompt][:title]
		if @prompt.save